package Answer;

public class Task_1 {

    public String task_1(){
        // Задача была выполнена за 5 минут

        String[] tower =new String[]{"Москва", "Санкт-Петербург", "Воронеж"};

        //System.out.print(tower1 + ".");
        return String.join(", ",tower);
    }
}
